backend: "python"
input [
  {
    name: "post_input"
    data_type: TYPE_FP32
    dims: [ -1, 17, 64, 48]
  }
]
output [
  {
    name: "post_output"
    data_type: TYPE_FP32
    dims: [ -1, 17, 3]
  }
]