platform: "tensorrt_plan"
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ -1, 3, 256, 192]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [-1, 17, 64, 48]
  }
]